x = float(input("Задайте значення абсциси точки: "))    # Введення значення x
y = float(input("Задайте значення ординати точки: "))   # Введення значення y

# Перевірка належності точки до заштрихованої частини площини
if not(x < 0 < y) and x**2 + y**2 >= 9 and abs(x) <= 3 and abs(y) <= 3:
    print("Точка з координатами (" + str(x) + ", " + str(y) + ") належить заштрихованій частині площини") # Результат 1
else:
    print("Точка з координатами (" + str(x) + ", " + str(y) + ") не належить заштрихованій частині площини") # Результат 2
